## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 20 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_iam_policy.forms_lambda_parameter_store`                        |
|        | `aws_iam_role.forms_lambda_client`                                   |
|        | `aws_iam_role_policy_attachment.cognito_forms_lambda_client`         |
|        | `aws_iam_role_policy_attachment.dynamodb_forms_lambda_client`        |
|        | `aws_iam_role_policy_attachment.forms_lambda_client_vpc_access`      |
|        | `aws_iam_role_policy_attachment.forms_lambda_parameter_store`        |
|        | `aws_iam_role_policy_attachment.kms_forms_lambda_client`             |
|        | `aws_iam_role_policy_attachment.s3_forms_lambda_client`              |
|        | `aws_iam_role_policy_attachment.secrets_manager_forms_lambda_client` |
|        | `aws_iam_role_policy_attachment.sqs_forms_lambda_client`             |
|        | `aws_lambda_permission.submission_lambda_invoke`                     |
|        | `aws_security_group.lambda_client_pr_review`                         |
|        | `aws_security_group_rule.database_lambda_client_ingress`             |
|        | `aws_security_group_rule.internet_ingress_to_lambda_client`          |
|        | `aws_security_group_rule.lambda_client_egress_database`              |
|        | `aws_security_group_rule.lambda_client_egress_privatelink`           |
|        | `aws_security_group_rule.lambda_client_egress_redis`                 |
|        | `aws_security_group_rule.lambda_client_egress_to_internet`           |
|        | `aws_security_group_rule.privatelink_lambda_client_ingress`          |
|        | `aws_security_group_rule.redis_lambda_client_ingress`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.forms_lambda_parameter_store will be created
  + resource "aws_iam_policy" "forms_lambda_parameter_store" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "formsLambdaParameterStoreRetrieval"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:687401027353:parameter/form-viewer/env"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.forms_lambda_client will be created
  + resource "aws_iam_role" "forms_lambda_client" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-lambda-client"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cognito_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "cognito_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/cognito"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.dynamodb_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/forms_dynamodb"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.forms_lambda_client_vpc_access will be created
  + resource "aws_iam_role_policy_attachment" "forms_lambda_client_vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.forms_lambda_parameter_store will be created
  + resource "aws_iam_role_policy_attachment" "forms_lambda_parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.kms_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "kms_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/ecs_kms"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.s3_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "s3_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/formsS3Access"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.secrets_manager_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "secrets_manager_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/formsSecretsManagerKeyRetrieval"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.sqs_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "sqs_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/forms_sqs"
      + role       = "forms-lambda-client"
    }

  # aws_lambda_permission.submission_lambda_invoke will be created
  + resource "aws_lambda_permission" "submission_lambda_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "Submission"
      + id                  = (known after apply)
      + principal           = (known after apply)
      + statement_id        = "AllowSubmissionInvokeFromPRReviewEnvs"
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.lambda_client_pr_review will be created
  + resource "aws_security_group" "lambda_client_pr_review" {
      + arn                    = (known after apply)
      + description            = "Lambda admin PR review environment"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lambda-admin-pr-review"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group_rule.database_lambda_client_ingress will be created
  + resource "aws_security_group_rule" "database_lambda_client_ingress" {
      + description              = "Security group rule for Forms DB ingress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b80bb714d886b8ff"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.internet_ingress_to_lambda_client will be created
  + resource "aws_security_group_rule" "internet_ingress_to_lambda_client" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound connections from the internet to the lambda PR review env"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.lambda_client_egress_database will be created
  + resource "aws_security_group_rule" "lambda_client_egress_database" {
      + description              = "Security group rule for Forms DB egress to Database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b80bb714d886b8ff"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_privatelink will be created
  + resource "aws_security_group_rule" "lambda_client_egress_privatelink" {
      + description              = "Security group rule for Forms egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-089a83b7d81dff031"
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_redis will be created
  + resource "aws_security_group_rule" "lambda_client_egress_redis" {
      + description              = "Security group rule for Forms DB egress to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-092fddfbbac0e15aa"
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_to_internet will be created
  + resource "aws_security_group_rule" "lambda_client_egress_to_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound connections from lambda PR review env to the internet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.privatelink_lambda_client_ingress will be created
  + resource "aws_security_group_rule" "privatelink_lambda_client_ingress" {
      + description              = "Security group rule for Forms ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-089a83b7d81dff031"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.redis_lambda_client_ingress will be created
  + resource "aws_security_group_rule" "redis_lambda_client_ingress" {
      + description              = "Security group rule for Forms Redis ingress"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-092fddfbbac0e15aa"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_lambda_parameter_store"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
